FKDD_COPY_DIFF_3_2026-02-13/DataProcessors/ЗакрытиеСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗакрытиеСмены</Name>
			<Comment>Закрытие кассовой смены</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата закрытия кассовой смены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата закрытия кассовой смены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусыОборудования</Name>
					<Comment>Текущее состояние оборудования</Comment>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КассыККМ</Name>
					<Comment>Таблица закрываемых касс ККМ</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Comment>Признак закрытия смены кассы ККМ</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КассаККМ</Name>
							<Comment>Закрываемая касса ККМ</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Оборудование, используемое при закрытии смены</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Comment>Признак закрытия смены оборудования</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Comment>Оборудование</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Компьютер</Name>
							<Comment>Компьютер</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассОборудования</Name>
							<Comment>Класс оборудования</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.КлассыОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Comment>Приоритет</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/AccumulationRegisters/КассыККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>КассыККМ</Name>
			<Comment>Кассы ККМ</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КассаККМ</Name>
					<Comment>Касса ККМ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособОплаты</Name>
					<Comment>Способ оплаты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОплат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/КлассыОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КлассыОборудования</Name>
			<Comment>Классы оборудования</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Авторизатор</Name>
					<Comment>Используется для проведения безналичных платежей через банковские процессинговые центры с использованием пластиковых карточек (эквайринг). Обычно устанавливается на каждое кассовое рабочие место, Иногда - один на несколько касс</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Весы</Name>
					<Comment>Торговые и промышленные весы и этикетировочные комплексы используются для получения текущего веса по запросу (например на кассовом месте)  и для печати этикеток при фасовке весовых товаров. Для этого товарный ассортимент должен быть загружен в весы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дисплей</Name>
					<Comment>Предназначен для информирования покупателя о текущих "пробиваемых" кассиром товарах и их ценах. Так же может выводить дополнительную информацию. Обычно устанавливается на каждое рабочее место кассира, совместно с Фискальным регистратором.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коммуникатор</Name>
					<Comment>Оборудование для отправки и приема SMS-сообщений. Позволяет настроить подключение для отправки SMS через Интернет (сервер www.sms4b.ru), или с использованием дополнительного устройства - GSM-модема.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принтер</Name>
					<Comment>Используются для печати этикеток (обычно самоклеящихся на рулонной бумаге) и ценников. Каждый принтер рассчитан на разные размеры этикеток и может иметь индивидуальные особенности настройки печати.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сканер</Name>
					<Comment>Предназначен для поиска товаров по штрих-коду при вводе документов (например при работе кассира). Так же к этому классу устройств относятся считыватели различных идентификационных карточек и меток (магнитных, RFID и т.п.).</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТСД</Name>
					<Comment>Мобильное устройство. Используются для подбора товарных документов (отгрузки, поставки, инвентаризации) на складе в отрыве от основной системы с последующей выгрузкой собранных данных, непосредственно в документы системы.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФР</Name>
					<Comment>Предназначен для фиксации факта и суммы розничной продажи и печати кассового чека. Используется при пробитии чека из АРМ кассира. Так же может использоваться для печати некоторых нефискальных документов. Обычно устанавливается на каждое кассовое место.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/СтатусыОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОборудования</Name>
			<Comment>Статусы оборудования</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включено</Name>
					<Comment>Включено, готово к получению заданий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
					<Comment>Не прописано в системе оборудования или было удалено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выключено</Name>
					<Comment>Выключено в данный момент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недоступно</Name>
					<Comment>Нет связи или не включен сервер</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занято</Name>
					<Comment>Заблокировано с другого рабочего места</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готово</Name>
					<Comment>Включено и заблокировано для монопольного использования, готово к получению заданий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользуется</Name>
					<Comment>Данное устройство помечено как неиспользуемое в настоящее время, обращаться к нему не имеет смысла</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетДрайвера</Name>
					<Comment>Нет драйвера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрещено</Name>
					<Comment>Работа с оборудованием запрещена</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалено</Name>
					<Comment>Данный экземпляр оборудования был удален в схеме СЗиУО</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
					<Comment>Произошла ошибка при обращении к оборудованию</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ТипыОплатыВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыОплатыВРознице</Name>
			<Comment>Типы оплаты в рознице</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Оплата наличными</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
					<Comment>Оплата платежными картами</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Оплата в кредит</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлубнаяКарта</Name>
					<Comment>Оплата клубной картой</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
					<Comment>Оплата талоном/купоном</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетЗаведения</Name>
					<Comment>Оплата за счет заведения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ТипыОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТипыОплат</Name>
			<Comment>Типы оплат</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Comment>Вид оплаты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект оплаты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплатыВРознице</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплатыККТ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплатыККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/DataProcessors/ЗакрытиеСмены/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

#Если Клиент Тогда
Перем Рарус_Компонента		Экспорт;	// Локальная ссылка на внешнюю компоненту типового решения
Перем ТаблицаСверткиЧеков 	Экспорт;    // Таблица сворачиваемых чеков
Перем СоответсвияФРКасса	Экспорт;    // Соответствие с кассами
Перем ВызовИзФронта 		Экспорт;    // флаг вызова из фронта кассира
Перем ВладелецОбработки		Экспорт;	// Форма-Владелец формы обработки закрытия смены

// Вывод сообщения пользователю
Процедура СообщитьПользователю(Текст,Статус=Неопределено) Экспорт
	Если Статус=Неопределено Тогда
		Статус=СтатусСообщения.БезСтатуса;
	КонецЕсли; 
	Если ВладелецОбработки<>Неопределено Тогда
		Попытка
			ВладелецОбработки.ОткрытьДиалог(Текст,Статус);
		Исключение
		КонецПопытки; 
		Возврат;
	КонецЕсли; 
	
	Сообщить(Текст,Статус);
КонецПроцедуры // СообщитьПользователю() 

// Функция определение приоретета класса оборудования
Функция ПолучитьПриоритетКлассаОборудования(КлассОборудования)
	// Возвращает очередность закрытия смены для устройства по классу
	Если КлассОборудования=Неопределено Тогда Возврат 0; КонецЕсли;
	Возврат 0;
КонецФункции // ПриоритетКласса

// Загружает список оборудования
Процедура ЗагрузитьСписокОборудования(ИмяФильтра=Неопределено,УсловиеФильтра=Неопределено,ЗначениеФильтра=Неопределено) Экспорт
	Если ИмяФильтра=Неопределено Тогда
		//Выбирать только оборудование нужных классов
		ИмяФильтра="КлассОборудования";
		УсловиеФильтра="И Оборудование.КлассОборудования В(&КлассОборудования)";
		ЗначениеФильтра=Новый Массив;
		ЗначениеФильтра.Добавить(Перечисления.КлассыОборудования.Авторизатор);
		ЗначениеФильтра.Добавить(Перечисления.КлассыОборудования.ФР);
	КонецЕсли; 
	ТекстЗапроса="ВЫБРАТЬ
	             |	ЛОЖЬ КАК Использовать,
	             |	Оборудование.Ссылка КАК Оборудование,
	             |	Оборудование.Компьютер,
	             |	Оборудование.КлассОборудования,
	             |	0 КАК Приоритет
	             |ИЗ
	             |	Справочник.Оборудование КАК Оборудование
	             |ГДЕ
	             |	Оборудование.ПометкаУдаления = ЛОЖЬ
				 |	//УСЛОВИЕ ФИЛЬТРА";
	ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"//УСЛОВИЕ ФИЛЬТРА",УсловиеФильтра);
	Запрос=Новый Запрос;
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр(ИмяФильтра,ЗначениеФильтра);
	Оборудование.Загрузить(Запрос.Выполнить().Выгрузить());
	Для Каждого СтрокаОборудования Из Оборудование Цикл
		СтрокаОборудования.Приоритет=ПолучитьПриоритетКлассаОборудования(СтрокаОборудования.КлассОборудования);
	КонецЦикла; 
КонецПроцедуры

// Загрузка статусов оборудования
Процедура ЗагрузитьСтатусыОборудования() Экспорт
	Выборка=Справочники.Оборудование.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтатусыОборудования.Вставить(Выборка.Ссылка,глТорговоеОборудование.СтатусОборудования(Выборка.Ссылка));
	КонецЦикла;
КонецПроцедуры

// установить использование по умолчанию
Процедура УстановитьИспользованиеПоУмолчанию() Экспорт
	// загружаем текущие статусы устройств
	ЗагрузитьСтатусыОборудования();
	
	// устанавливаем использование для включенного оборудования
	Для Каждого СтрокаОборудования Из Оборудование Цикл
				
		//Использование устройства допустимо при его включенности
		СтатусОборудования=СтатусыОборудования[СтрокаОборудования.Оборудование];
		Если СтатусОборудования=Перечисления.СтатусыОборудования.Включено Тогда
			СтрокаОборудования.Использовать=Истина;
		Иначе
			СтрокаОборудования.Использовать=Ложь;
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры

// Установить использование для всех
Процедура УстановитьИспользованиеДляВсех(ФлагИспользования) Экспорт
	Для каждого СтрокаОборудования Из Оборудование Цикл
		СтрокаОборудования.Использовать=ФлагИспользования;
	КонецЦикла; 
КонецПроцедуры

// Включить все оборудование
Процедура ВключитьВсеОборудование(ФлагВключения) Экспорт
	Для каждого СтрокаОборудования Из Оборудование Цикл
		СтатусОборудования=СтатусыОборудования[СтрокаОборудования.Оборудование];
		Если ФлагВключения Тогда
			Если СтатусОборудования=Перечисления.СтатусыОборудования.Выключено Тогда
				ОписаниеОшибки = "";
				КодОшибки=глТорговоеОборудование.ВключитьОборудование(СтрокаОборудования.Оборудование.ИдентификаторОборудования,ОписаниеОшибки);
				Если КодОшибки<>0 Тогда 
					ОписаниеОшибки = "Ошибка при включении " + СтрокаОборудования.Оборудование.Наименование + " " +Символы.ПС + ОписаниеОшибки;
					СообщитьПользователю(ОписаниеОшибки,СтатусСообщения.Важное); 
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если СтатусОборудования=Перечисления.СтатусыОборудования.Включено Тогда
				ОписаниеОшибки = "";
				КодОшибки=глТорговоеОборудование.ВыключитьОборудование(СтрокаОборудования.Оборудование.ИдентификаторОборудования,ОписаниеОшибки);
				Если КодОшибки<>0 Тогда 
					ОписаниеОшибки = "Ошибка при выключении " + СтрокаОборудования.Оборудование.Наименование + " " +Символы.ПС + ОписаниеОшибки;
					СообщитьПользователю(ОписаниеОшибки,СтатусСообщения.Важное); 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	ЗагрузитьСтатусыОборудования();
КонецПроцедуры

// Выполняет создание документа закрытие смены
Функция ВыполнитьЗакрытиеСмены() Экспорт
	Результат=Истина;
	Состояние("Закрытие смены ...");
	
	ТВ="Закрыть смену со следующими параметрами:";
	ТВ=ТВ+Символы.ПС+Символы.ПС+"Выполнить гашение авторизаторов";
	
	// закрытие смены на оборудовании
	тзОборудование = Оборудование.Выгрузить();
	ОтборПоКлассу =  Новый Структура();
	ОтборПоКлассу.Вставить("КлассОборудования", Перечисления.КлассыОборудования.Авторизатор);
	Автризаторы = тзОборудование.НайтиСтроки(ОтборПоКлассу);

	ОтборПоКлассу.Вставить("Использовать", Истина);
	Автризаторы = тзОборудование.НайтиСтроки(ОтборПоКлассу);

	ФР=ПараметрыСеанса.Компьютер.ФР;
	
	// Закрытие смены на Авторизаторах
	флЗакрыватьСменуНаАвторизаторах = обПраво("РазрешитьГашениеАвторизаторов",глПрава);
	
	// Создаем список авторизаторов
	спАвт = Новый СписокЗначений;
	спАвт.Очистить();
	
	// Производим заполнение списка авторизаторов
	Если флЗакрыватьСменуНаАвторизаторах Тогда
		// Список оборудования
		Автризаторы = тзОборудование.НайтиСтроки(ОтборПоКлассу);
		Для Каждого Авторизатор Из Автризаторы Цикл	
			Если СтатусыОборудования[Авторизатор.Оборудование]<>Перечисления.СтатусыОборудования.Включено Тогда Продолжить; КонецЕсли;
			
			ТВ=ТВ+Символы.ПС+"  •  "+Авторизатор.Оборудование;
			спАвт.Добавить(Авторизатор.Оборудование);
		КонецЦикла;
		
		Если Автризаторы.Количество() = 0 Тогда 
			ТВ=ТВ+Символы.ПС+"  <нет доступных устройств>";
		Иначе
			// Опции
			ТВ=ТВ+Символы.ПС+"  -  Печать квитанций: "+?(обЗначениеНеЗаполнено(ФР)=0,ФР,"<не определена>");
		КонецЕсли;
	Иначе 
		ТВ=ТВ+Символы.ПС+"  <не доступно>";
	КонецЕсли;
	
	// Закрытие смены на ФРах
	флЗакрыватьСменуНаФРах = обПраво("РазрешитьГашениеФискСчетчиков",глПрава);
	флИнкассация = обПраво("РазрешитьПроводитьИнкассацию",глПрава);
	флОтчеты = флЗакрыватьСменуНаФРах;
	
	// Создадим список ФР-ров
	спФР = Новый СписокЗначений;
	спФР.Очистить();
	
	// Производим заполнение списка
	Если флЗакрыватьСменуНаФРах Тогда
		ТВ=ТВ+Символы.ПС+Символы.ПС+"Выполнить гашение фискальных регистраторов";
		
		// Список оборудования
		ОтборПоКлассу.КлассОборудования = Перечисления.КлассыОборудования.ФР;
		ФРы = тзОборудование.НайтиСтроки(ОтборПоКлассу);
		Для Каждого ФР Из ФРы Цикл
			
			Если СтатусыОборудования[ФР.Оборудование]<>Перечисления.СтатусыОборудования.Включено Тогда Продолжить; КонецЕсли;

			ТВ=ТВ+Символы.ПС+"  •  "+ФР.Оборудование;
			спФР.Добавить(ФР.Оборудование);
		КонецЦикла;
		
		Если ФРы.Количество() = 0 Тогда 
			ТВ=ТВ+Символы.ПС+"  <нет доступных устройств>";
		Иначе
			// Опции
			ТВ=ТВ+Символы.ПС+"  -  Инкассировать перед гашением:      "+?(флИнкассация,"Да","Нет");
			ТВ=ТВ+Символы.ПС+"  -  Производить гашение ФР (Z-отчет): "+?(флОтчеты,"Да","Нет");
		КонецЕсли;

	Иначе
		ТВ=ТВ+Символы.ПС+"  <не доступно>";
	КонецЕсли;
	
	// Регламентные действия
	флОформитьПКО = флИнкассация И обПраво("СоздаватьПКОПриЗакрытииКассовойСмены",глПрава);
	флОформитьБВ = Ложь;
	флВыполнитьСжатиеАрхиваЧеков = обПраво("ВыполнятьСжатиеАрхиваЧеков",глПрава);
	флВклРегламент = флОформитьПКО ИЛИ флОформитьБВ ИЛИ флВыполнитьСжатиеАрхиваЧеков;
	
	ТВ=ТВ+Символы.ПС+Символы.ПС+"Выполнить регламентные действия";

	Если флВклРегламент Тогда
		// Опции
		ТВ=ТВ+Символы.ПС+"  -  Оформить приходный ордер:            "+?(флОформитьПКО,"Да","Нет");
		ТВ=ТВ+Символы.ПС+"  -  Оформить банковскую выписку:      "+"Не используется";//?(флОформитьБВ,"Да","Нет");
		ТВ=ТВ+Символы.ПС+"  -  Выполнить сжатие архива чеков:    "+?(флВыполнитьСжатиеАрхиваЧеков,"Да","Нет");
	Иначе
		ТВ=ТВ+Символы.ПС+" <не доступно>";
	КонецЕсли;
	
	Если Вопрос(ТВ,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Внимание")<>КодВозвратаДиалога.Да Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	// свертка чеков
	Состояние("Выполнение свертки чеков ...");
	Если НЕ ВыполнитьСверткуЧеков() Тогда Результат=Ложь; Перейти ~ОкончаниеЗакрытияСмены; КонецЕсли; 

	// Закрытие смены на ФРах
	Состояние("Выполнение закрытия смены фискальных регистраторов ...");
	Для Каждого ФР из спФР Цикл
		Если СтатусыОборудования[ФР.Значение]<>Перечисления.СтатусыОборудования.Включено Тогда Продолжить; КонецЕсли;

		ТекстОшибки = "";
		Если НЕ ЗакрытиеСменыФР(ФР.Значение, ТекстОшибки) Тогда
			ОписаниеОшибки = Рарус_Компонента.ОписаниеОшибки;
			СообщитьПользователю("Ошибка при гашении фискальных регистраторов"+ Символы.ПС+ ТекстОшибки+Символы.ПС+
			"Закрытие кассовой смены ПРЕРВАНО", СтатусСообщения.Важное);
			Возврат Ложь;
		КонецЕсли;

	КонецЦикла;
	
	// Закрытие смены на Авторизаторах
	Состояние("Выполнение закрытия смены авторизаторов ...");
	Для Каждого Авт из спАвт Цикл
		Если СтатусыОборудования[Авт.Значение]<>Перечисления.СтатусыОборудования.Включено Тогда Продолжить; КонецЕсли;

		Результат = ЗакрытиеСменыАвторизатор(Авт.Значение, ТекстОшибки);
		Результат = ?(Результат = 0, Истина, Ложь);
		Если НЕ Результат Тогда
			ОписаниеОшибки = Рарус_Компонента.ОписаниеОшибки;
			СообщитьПользователю("Ошибка при гашении авторизаторов"+ Символы.ПС+
			"Закрытие кассовой смены ПРЕРВАНО", СтатусСообщения.Важное);
			Возврат Ложь;
		КонецЕсли;

	КонецЦикла;

	Состояние("Выполнение регламентных операций ...");
	Если НЕ ВыполнитьРегламентныеОперации() Тогда Результат=Ложь; Перейти ~ОкончаниеЗакрытияСмены; КонецЕсли; 
	
	Состояние("Выполнение печати отчетов ...");
	Если НЕ ВыполнитьПечатьОтчетов() Тогда Результат=Ложь; Перейти ~ОкончаниеЗакрытияСмены; КонецЕсли; 
	
	Состояние("Выполнение обмена данными ...");
	Если НЕ ВыполнитьОбменДанными() Тогда Результат=Ложь; Перейти ~ОкончаниеЗакрытияСмены; КонецЕсли; 
	
	~ОкончаниеЗакрытияСмены:
	Состояние("");
	Возврат Результат;
КонецФункции

// Получить доступные виды оплат
Функция ПолучитьДоступныеВидыОплат(ФР, тзДоступныеВидыОплат, ТекстОшибки) Экспорт
	
	GUID_ФР = ФР.ИдентификаторОборудования;  ТаймаутФР = ФР.Таймаут;

	ЗначениеСвойства = ""; ТекстОшибки = "";
	Если НЕ глТорговоеОборудование.ПолучитьЗначениеСвойстваОборудования(GUID_ФР,"НаименованияВидовПлатежей",ЗначениеСвойства,ТекстОшибки) Тогда
		ТекстОшибки = "Ошибка при получении таблицы доступных оплат ФРа " + ФР.Наименование +Символы.ПС + ТекстОшибки;
		Возврат Ложь;
	КонецЕсли;
	
	ЗначениеСвойства = СтрЗаменить(ЗначениеСвойства,";",Символы.ПС);
	Для Сч = 1 по СтрЧислоСтрок(ЗначениеСвойства) Цикл
		стрТипОплаты = СокрЛП(СтрПолучитьСтроку(ЗначениеСвойства,Сч));
		НомерОплаты  = Лев(стрТипОплаты,1);
		стрТипОплаты = СокрЛП(СтрЗаменить(стрТипОплаты,НомерОплаты+"=",""));
		ТипОплаты = Справочники.ТипыОплат.НайтиПоНаименованию(стрТипОплаты);
		
		Если НЕ ТипОплаты.Пустая() Тогда
			СтрокаОплат 		  = тзДоступныеВидыОплат.Добавить();
			СтрокаОплат.Номер 	  = Число(НомерОплаты);
			СтрокаОплат.ТипОплаты = ТипОплаты;
			
			Если ТипОплаты.ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет Тогда
					флДоступностьНал = Истина;
			Иначе   флДоступностьБН = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;	
КонецФункции

// получает остатки денег в кассе
//
Функция ПолучитьОстаткиДенегВКассе(ФР, КассаККМ, ОстаткиККМ, тзДоступныеВидыОплат, ТекстОшибки)
	
	GUID_ФР = ФР.ИдентификаторОборудования;  ТаймаутФР = ФР.Таймаут;
	
	Для каждого СтрокаДоступныхОплат из тзДоступныеВидыОплат Цикл
		Если СтрокаДоступныхОплат.ТипОплаты.Объект = Перечисления.ТипыОплатыВРознице.Наличные Тогда
			НомерНаличнойОплаты = СтрокаДоступныхОплат.Номер;
			СпрТипОплаты 		= СтрокаДоступныхОплат.ТипОплаты;
			Прервать;
		КонецЕсли;
	КонецЦикла;


	//Получить статус ФР
	SafeArrayСтатусыФР=Рарус_Компонента.СоздатьПараметры(,);
	КодОшибки=Рарус_Компонента.ЗаказатьВыполнениеДействияСинхронно(GUID_ФР,"ПолучитьСтатус",SafeArrayСтатусыФР,ТаймаутФР);
	Если КодОшибки <> 0 Тогда
		ТекстОшибки = "Ошибка при получении статуса ФРа " + ФР.Наименование + Символы.ПС + Рарус_Компонента.ОписаниеОшибки;
		Возврат Ложь;
	КонецЕсли;
	
	СуммаНаличными = 0;
	Попытка
		SafeArrayСчетчикиФР=SafeArrayСтатусыФР.GetValue(0,0);
		SafeArrayТаблицаОстатковВКассе=SafeArrayСтатусыФР.GetValue(1,0);
		КоличествоСтрок=0; КоличествоСтолбцов=0;
		SafeArrayТаблицаОстатковВКассе.GetBounds(КоличествоСтрок,КоличествоСтолбцов);
		Для Сч=0 По КоличествоСтрок-1 Цикл
			ОстаткиТипОплаты=Число(SafeArrayТаблицаОстатковВКассе.GetValue(Сч,0));
			Если ОстаткиТипОплаты<0 Тогда
				ОстаткиТипОплаты=0;
			КонецЕсли; 
			Если ОстаткиТипОплаты=0 Тогда
				СуммаНаличными=СуммаНаличными+Число(SafeArrayТаблицаОстатковВКассе.GetValue(Сч,2));
				Если СуммаНаличными<0 Тогда
					СуммаНаличными=0;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ТекстОшибки = "Ошибка при получении статуса ФРа " + ФР.Наименование + Символы.ПС + ТекстОшибки;
		Возврат Ложь;
	КонецПопытки; 
	
	// Получим остатки денег в текущей кассе ККМ
	тзОстаткиПоКассеККМ = дкПолучитьОстатокПоКассеККМ(КассаККМ, Дата);
	Для Каждого СтрокаОстаткиККМ ИЗ тзОстаткиПоКассеККМ Цикл
		СтрНомер = тзДоступныеВидыОплат.Найти(СтрокаОстаткиККМ.ТипОплаты,"ТипОплаты");
		Если СтрНомер = Неопределено Тогда Продолжить; КонецЕсли;
		
		новаяСтрока 			 = ОстаткиККМ.Добавить();
		новаяСтрока.ТипОплаты 	 = СтрокаОстаткиККМ.ТипОплаты;
		новаяСтрока.Сумма 		 = СтрокаОстаткиККМ.Сумма;
		новаяСтрока.СуммаВозврат = СтрокаОстаткиККМ.СуммаВозврат;
	КонецЦикла;
	
	флНаличные = Ложь;
	Для каждого СтрокаОстаткиККМ из ОстаткиККМ цикл
		Если СтрокаОстаткиККМ.ТипОплаты.Объект =  Перечисления.ТипыОплатыВРознице.Наличные Тогда
			флНаличные = Истина;
			Если СуммаНаличными <= 0 Тогда
				СтрокаОстаткиККМ.Сумма = 0;
			ИначеЕсли СтрокаОстаткиККМ.Сумма >=  СуммаНаличными Тогда
				СтрокаОстаткиККМ.Сумма = СуммаНаличными;
				СуммаНаличными = 0;
			ИначеЕсли СтрокаОстаткиККМ.Сумма < СуммаНаличными Тогда
				СуммаНаличными = СуммаНаличными - СтрокаОстаткиККМ.Сумма;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если  СуммаНаличными > 0 и флНаличные  Тогда
		Для каждого СтрокаОстаткиККМ из ОстаткиККМ цикл
			Если СтрокаОстаткиККМ.ТипОплаты.Объект =  Перечисления.ТипыОплатыВРознице.Наличные Тогда
				СтрокаОстаткиККМ.Сумма = СтрокаОстаткиККМ.Сумма + СуммаНаличными;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли СуммаНаличными > 0 и НЕ флНаличные Тогда
		новаяСтрока = ОстаткиККМ.Добавить();
		новаяСтрока.ТипОплаты = СпрТипОплаты;
		новаяСтрока.Сумма = СуммаНаличными;
	КонецЕсли; 
	
	Возврат Истина;
		
КонецФункции 

// Установка кассы ККМ
Функция ПолучитьКассуККМ(ФР, КассаККМ)
	
	КассаККМ = СоответсвияФРКасса[ФР];
	
	Возврат НЕ обЗначениеНеЗаполнено(КассаККМ);
	
КонецФункции

// Изъятие из кассы
Функция Изъятие(ФР, ТекстОшибки)
	
	// получим КассуККМ по ФРу, если нету Кассы то ничего делать не надо
	КассаККМ = Неопределено;
	Если НЕ ПолучитьКассуККМ(ФР, КассаККМ) Тогда
		Возврат Документы.Инкассация.ПустаяСсылка();
	КонецЕсли;
	
	ИнкассаторПоУмолчанию=обПраво("ИнкассаторПоУмолчанию",глПрава);
	Если обЗначениеНеЗаполнено(ИнкассаторПоУмолчанию) Тогда
		ТекстОшибки = "Для АРМ кассира не задан Инкассатор по умолчанию (см. настройки для подразделения """+СокрЛП(ПараметрыСеанса.ПодразделениеКомпании)+""")";
		Возврат Неопределено;
	КонецЕсли;
	
    ОсновнаяПлатежнаяСистема = обПраво("ОсновнаяПлатежнаяСистема",глПрава);

	тзДоступныеВидыОплат	= Новый ТаблицаЗначений;
	тзДоступныеВидыОплат.Колонки.Добавить("Номер");
	тзДоступныеВидыОплат.Колонки.Добавить("ТипОплаты");

	Если НЕ ПолучитьДоступныеВидыОплат(ФР, тзДоступныеВидыОплат, ТекстОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ОстаткиККМ = Новый ТаблицаЗначений;   
	ОстаткиККМ.Колонки.Добавить("ТипОплаты");
	ОстаткиККМ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ОстаткиККМ.Колонки.Добавить("Возврат", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ОстаткиККМ.Колонки.Добавить("СуммаВозврат", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Если НЕ ПолучитьОстаткиДенегВКассе(ФР, КассаККМ, ОстаткиККМ, тзДоступныеВидыОплат, ТекстОшибки) Тогда
		ТекстОшибки = "Ошибка при выполнении инкассации " + ТекстОшибки;
		Возврат Неопределено;
	КонецЕсли;
	
	GUID_ФР = ФР.ИдентификаторОборудования;  ТаймаутФР = ФР.Таймаут;	
	
	ДокументИнкассации=Документы.Инкассация.СоздатьДокумент();
	ДокументИнкассации.Дата=Дата;
	ДокументИнкассации.ХозОперация=Справочники.ХозОперации.ИзъятиеИзКассыККМ;
	ДокументИнкассации.КассаККМ=КассаККМ;
	ДокументИнкассации.Заполнить(Неопределено);
	ДокументИнкассации.Инкассатор=ИнкассаторПоУмолчанию;
	ДокументИнкассации.ПлатежнаяСистема=ОсновнаяПлатежнаяСистема;
	ДокументИнкассации.НомерЧека=0;
	ДокументИнкассации.ДатаФР=ТекущаяДата();
	ДокументИнкассации.НомерДокумента=0;
	ДокументИнкассации.НомерСмены=0;
	
	// вызовем обработчики 
	ДокументИнкассации.ОбработкаРеквизита("Инкассатор");
	ДокументИнкассации.ОбработкаРеквизита("ПлатежнаяСистема");
	
	//Запишем сумму инкассации в документ
	ДокументИнкассации.Оплаты.Очистить();
	Для каждого СтрокаОстаткиККМ из ОстаткиККМ Цикл
		Если СтрокаОстаткиККМ.Сумма <> 0 или СтрокаОстаткиККМ.СуммаВозврат <> 0 Тогда
			НоваяСтрока = ДокументИнкассации.Оплаты.Добавить();
			НоваяСтрока.ТипОплаты 	= СтрокаОстаткиККМ.ТипОплаты;
			НоваяСтрока.Сумма 		= СтрокаОстаткиККМ.Сумма;
			НоваяСтрока.СуммаВозврат = СтрокаОстаткиККМ.СуммаВозврат;
		КонецЕсли;
	КонецЦикла;
	
	НачатьТранзакцию();
	
	//Попробуем предварительно провести документ инкассации
	Попытка
		ДокументИнкассации.СообщениеОбОшибке="";
		ДокументИнкассации.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		ДокументИнкассации.СообщениеОбОшибке=Неопределено;
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = "Ошибка при записи документа Инкассации:"+Символы.ПС+ДокументИнкассации.СообщениеОбОшибке;
		Возврат Неопределено;
	КонецПопытки; 
	
	//Пробьем чек внесения в кассу ККМ
	SafeArrayПараметрыИнкассации=Рарус_Компонента.СоздатьПараметры(3,1);
	SafeArrayПараметрыИнкассации.SetValue(0,0,0); //Тип инкассация - внесение/изъятие
	SafeArrayПараметрыИнкассации.SetValue(2,0,ДокументИнкассации.Автор.ПарольККМ);
	КоличествоОплат=0;
	SafeArrayТаблицаОплат=Рарус_Компонента.СоздатьПараметры(ДокументИнкассации.Оплаты.Количество(),4);
	
	КоличествоОплат=0;
	Для Каждого СтрокаОплат из ОстаткиККМ Цикл
		СтрНомер = тзДоступныеВидыОплат.Найти(СтрокаОплат.ТипОплаты,"ТипОплаты");
		Если СтрНомер = Неопределено Тогда 
			ТекстОшибки = "ОШИБКА ПРИ ИНКАССАЦИИ:"+Символы.ПС+"Не определен тип оплаты "+СтрокаОплат +". Проверите настройки ФР!";
			Возврат Неопределено;
		КонецЕсли;
		Если СтрокаОплат.ТипОплаты.ТипОплатыККТ=Перечисления.ТипыОплатыККТ.Наличные Тогда
			Если (СтрокаОплат.Сумма - СтрокаОплат.СуммаВозврат) <> 0 Тогда
				SafeArrayТаблицаОплат.SetValue(КоличествоОплат,0,СтрНомер.Номер); //Тип оплаты - наличными
				SafeArrayТаблицаОплат.SetValue(КоличествоОплат,1,Строка(СтрокаОплат.ТипОплаты.Наименование)); //Параметр из таблицы ФР
				SafeArrayТаблицаОплат.SetValue(КоличествоОплат,2,(СтрокаОплат.Сумма - СтрокаОплат.СуммаВозврат)); //Сумма оплаты
				SafeArrayТаблицаОплат.SetValue(КоличествоОплат,1,("Изъятие "+Строка(СтрокаОплат.ТипОплаты.Наименование))); //Комментарий
				КоличествоОплат = КоличествоОплат+1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;		
	
	Если КоличествоОплат=0 Тогда
		//В документе нет сумм для инкассации. Выходим
		ЗафиксироватьТранзакцию();
		Возврат Документы.Инкассация.ПустаяСсылка();
	КонецЕсли; 
	
	SafeArrayПараметрыИнкассации.SetValue(1,0,SafeArrayТаблицаОплат);
	КодОшибки=Рарус_Компонента.ЗаказатьВыполнениеДействияСинхронно(GUID_ФР,"Инкассировать",SafeArrayПараметрыИнкассации,ТаймаутФР);
	Если КодОшибки <> 0 Тогда
		ОтменитьТранзакцию();
		ТекстОшибки = "Ошибка при выполнении Инкассации на ФРе " + ФР.Наименование +Символы.ПС + Рарус_Компонента.ОписаниеОшибки;
		Возврат Неопределено;
 	КонецЕсли;

	//Теперь подставим реальные фискальные реквизиты чека
	Попытка
		ДокументИнкассации.НомерСмены=Число(SafeArrayПараметрыИнкассации.GetValue(0,0));
		ДокументИнкассации.НомерЧека=Число(SafeArrayПараметрыИнкассации.GetValue(1,0));
		ДокументИнкассации.НомерДокумента=Число(SafeArrayПараметрыИнкассации.GetValue(2,0));
		ДокументИнкассации.ДатаФР=Вычислить("'"+SafeArrayПараметрыИнкассации.GetValue(3,0)+"'");
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = "Ошибка получения фискальных реквизитов чека с ФРа " + ФР.Наименование; 
		Возврат Неопределено;
	КонецПопытки; 

	//Окончательно проводим документ инкассации
	Попытка
		ДокументИнкассации.СообщениеОбОшибке="";
		ДокументИнкассации.Записать();
		ДокументИнкассации.СообщениеОбОшибке=Неопределено;
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = "Ошибка при записи фискальных реквизитов документа Инкассации:"+Символы.ПС+ДокументИнкассации.СообщениеОбОшибке;
		Возврат Неопределено;
	КонецПопытки; 

	//Все нормально - зафиксируем транзакцию
	ЗафиксироватьТранзакцию();
	
	Возврат ДокументИнкассации.Ссылка;
КонецФункции

Функция ОформлениеПКО(ИнкассацияСсылка, ТекстОшибки)
	
	Если обЗначениеНеЗаполнено(ИнкассацияСсылка) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДокументПКО=Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	ДокументПКО.Дата=Дата;
	ДокументПКО.ХозОперация=Справочники.ХозОперации.ПриходныйКассовыйОрдер;
	ДокументПКО.Заполнить(ИнкассацияСсылка);
	ДокументПКО.СтатьяДДС=Справочники.СтатьиДДС.РозничнаяВыручка;
	
	Если ДокументПКО.СуммаДокумента=0 Тогда
		Возврат Истина;
	КонецЕсли; 
	
	//Попробуем провести документ ПКО
	Попытка
		ДокументПКО.СообщениеОбОшибке="";
		ДокументПКО.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		//ДокументПКО.СообщениеОбОшибке=Неопределено;
	Исключение
		ТекстОшибки = "Ошибка при записи документа ПКО:"+Символы.ПС+ДокументПКО.СообщениеОбОшибке;
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;
КонецФункции

// Закрытие смены ФР
Функция ЗакрытиеСменыФР(ФР, ТекстОшибки)
	
	флИнкассация = обПраво("РазрешитьПроводитьИнкассацию",глПрава);
	флОформитьПКО = флИнкассация И обПраво("СоздаватьПКОПриЗакрытииКассовойСмены",глПрава);
	флОтчеты = Истина;
	
	Если флИнкассация Тогда
		ИнкассацияСсылка=Изъятие(ФР, ТекстОшибки);
		Если ИнкассацияСсылка=Неопределено Тогда 
			ТекстОшибки = "Ошибка инкассации: " + ТекстОшибки;
			Возврат Ложь; 
		КонецЕсли;	// Все действия выполняются в обработке (результат инвертирован)
	КонецЕсли;
	
	Если флОформитьПКО Тогда
		Если НЕ ОформлениеПКО(ИнкассацияСсылка, ТекстОшибки) Тогда 
			ТекстОшибки = "Ошибка формирования ПКО: " + ТекстОшибки;
			Возврат Ложь; 
		КонецЕсли;	// Все действия выполняются в обработке (результат инвертирован)
	КонецЕсли;
	
	Если флОтчеты Тогда
		
		SafeArrayПараметры=Рарус_Компонента.СоздатьПараметры(2,1);
		
		ТекущийПользователь = ПараметрыСеанса.Пользователь;
		SafeArrayПараметры.SetValue(0,0,Строка(ТекущийПользователь.Наименование));// Кассир - наименование ответственного за чек
		SafeArrayПараметры.SetValue(1,0,ТекущийПользователь.ИНН);// ИНН Кассира
		
		GUID_ФР = ФР.ИдентификаторОборудования;  ТаймаутФР = ФР.Таймаут;
		КодОшибки=Рарус_Компонента.ЗаказатьВыполнениеДействияСинхронно(GUID_ФР,"Z_Отчет",SafeArrayПараметры,ТаймаутФР);
		Если КодОшибки <> 0 Тогда
			ТекстОшибки = "Ошибка при печати Z отчета на ФРе " + ФР.Наименование +Символы.ПС + Рарус_Компонента.ОписаниеОшибки;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Закрытие смены авторизатор
Функция ЗакрытиеСменыАвторизатор(Авторизатор, ТекстОшибки)
	//1. Проверка права на закрытие смены авторизатора
	//2. Проверка того, что устройство включено
	//3. Закрытие смены авторизатора
	//4. Печать квитанции
	
	GUID_Авторизатор = Авторизатор.ИдентификаторОборудования;  ТаймаутАвторизатора =Авторизатор.Таймаут;
	// Подготовка к выполнению задания на оборудовании	
	Параметры=Рарус_Компонента.СоздатьПараметры(2,1);
	КодОшибки=Рарус_Компонента.ЗаказатьВыполнениеДействияСинхронно(GUID_Авторизатор,"ЗакрытьСмену",Параметры,ТаймаутАвторизатора);
    Если КодОшибки <> 0 Тогда
		ТекстОшибки = "Ошибка при закрытии смены на авторизаторе " + Авторизатор.Наименование +Символы.ПС + Рарус_Компонента.ОписаниеОшибки;
		Возврат Ложь;
	КонецЕсли;
	
	// Печать квитанции	
	УстройствоПечатиНефискальныхДокументов = обПраво("УстройствоПечатиНефискальныхДокументов");
	GUID_ФР=УстройствоПечатиНефискальныхДокументов.ИдентификаторОборудования;  ТаймаутФР = УстройствоПечатиНефискальныхДокументов.Таймаут;
	
	Если ПустаяСтрока(GUID_ФР) Тогда
		GUID_ФР=ПараметрыСеанса.Компьютер.ФР.ИдентификаторОборудования;
		ТаймаутФР = ПараметрыСеанса.Компьютер.ФР.Таймаут;		
	КонецЕсли;

	Если НЕ ПустаяСтрока(GUID_ФР) Тогда // Печать на оборудовании
		Попытка 
			КолвоСвойств=0; КолвоПолей=0;
			Параметры.GetBounds(КолвоСвойств,КолвоПолей);
			КодАвторизацииПлатежа=Параметры.GetValue(0,0);
			ТекстКвитанцииПлатежа=СокрЛП(Параметры.GetValue(1,0));
			Если ПустаяСтрока(ТекстКвитанцииПлатежа) Тогда 
				ТекстОшибки="Авторизатор не вернул текст квитанции авторизации платежа!
				|Невозможно распечатать квитанцию!";
			Иначе
				// Подготавливаем задание печати квитанции	
				ПараметрыДействия=Рарус_Компонента.СоздатьПараметры(4,1);
				ПараметрыДействия.SetValue(0,0,"");
				ПараметрыДействия.SetValue(1,0,ТекстКвитанцииПлатежа);
				ПараметрыДействия.SetValue(2,0,"");
				ПараметрыДействия.SetValue(3,0,0);
				КодОшибки=Рарус_Компонента.ЗаказатьВыполнениеДействияСинхронно(GUID_ФР,"Напечатать",ПараметрыДействия,ТаймаутФР);
			КонецЕсли;
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ТекстОшибки="Авторизатор вернул некорректные параметры совершенного платежа!
			|Невозможно распечатать квитанцию!";
		КонецПопытки;
	КонецЕсли;
	
	Возврат 0;
КонецФункции // ЗакрытиеСменыАвторизатор()

// Функция архивирования чеков
Функция ВыполнитьРегламентныеОперации()	
	
	// Выполним сжатие архива чеков
	Если обПраво("ВыполнятьСжатиеАрхиваЧеков",глПрава) Тогда
		Обработки.ФронтКассира.Создать().АрхивЧековСжать(ЭтотОбъект.Дата);
	КонецЕсли;
	
	Возврат Истина;
КонецФункции // ВыполнитьРегламентныеОперации()

// Производит свертку чеков и формирует документ закрытия смены
// Возвращаемое значение:
//   Булево – Результат выполнения свертки
Функция ВыполнитьСверткуЧеков()
	РезультатСвертки=Истина;
		
	КассыККМДляСвертки=КассыККМ.НайтиСтроки(Новый Структура("Использовать",Истина));
	Для каждого КассаККМ Из КассыККМДляСвертки Цикл
		
		Если НЕ РезультатСвертки Тогда
			//дальше не будем создавать документы
			//если не удалось записать документ, то на следующих возникает ошибка вида
			//"В данной транзакции уже происходили ошибки!"
			Возврат РезультатСвертки;
		КонецЕсли;
		
		ДокументЗакрытияСмены=Документы.ЗакрытиеСмены.СоздатьДокумент();
		ДокументЗакрытияСмены.Дата=Дата;
		ДокументЗакрытияСмены.КассаККМ=КассаККМ.КассаККМ;
		ДокументЗакрытияСмены.Заполнить(Неопределено);
		ДокументЗакрытияСмены.ОбработкаРеквизита("КассаККМ");
		
		ДокументЗакрытияСмены.ЗагрузитьЧекиПоКассеККМ();
		Попытка
			ДокументЗакрытияСмены.Записать(РежимЗаписиДокумента.Проведение);
			Если НЕ ДокументЗакрытияСмены.Проведен Тогда
				РезультатСвертки=Ложь;
			КонецЕсли; 
		Исключение
			СообщитьПользователю("Ошибка проведения документа <"+СокрЛП(ДокументЗакрытияСмены)+">"); 
			РезультатСвертки=Ложь;
		КонецПопытки; 
	КонецЦикла; 
	
	Возврат РезультатСвертки;
КонецФункции

// проверка получившихся сумм
Функция ПроверитьРасхожденияСумм() Экспорт
	
	РазрешитьЗакрытиеСменыПриРасхождениях = обПраво("РазрешитьЗакрытиеСменыПриРасхождениях",глПрава);
	
	Если РазрешитьЗакрытиеСменыПриРасхождениях = Перечисления.ВидыКонтроля.НеКонтролировать Тогда
		Возврат Истина;
	ИначеЕсли РазрешитьЗакрытиеСменыПриРасхождениях = Перечисления.ВидыКонтроля.Предупреждать Тогда
		РазрешитьЗакрытиеСменыПриРасхождениях = Истина;
	ИначеЕсли РазрешитьЗакрытиеСменыПриРасхождениях = Перечисления.ВидыКонтроля.Запрещать Тогда
		РазрешитьЗакрытиеСменыПриРасхождениях = Ложь;
	КонецЕсли;
		
	Состояние("Проверка расхождения сумм ...");
		
	ТаймаутФР = 60;
	
	СуммыВФР = Новый Соответствие;
	
	Результат = Истина;
	
	Для Каждого ТекКасса Из КассыККМ Цикл
		Если НЕ ТекКасса.Использовать Тогда
			Продолжить;
		КонецЕсли;	
				
		////Определим последний документ закрытия смены по данной кассе
		//Запрос=Новый Запрос;
		//Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		//			 |	ЗакрытиеСмены.ДатаПоследнегоДокумента КАК ДатаПоследнегоДокумента
		//			 |ИЗ
		//			 |	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
		//			 |ГДЕ
		//			 |	ЗакрытиеСмены.КассаККМ = &КассаККМ
		//			 |  И ЗакрытиеСмены.Проведен
		//			 |	И ЗакрытиеСмены.ДатаПоследнегоДокумента < &ДатаПоследнегоДокумента
		//			 |
		//			 |УПОРЯДОЧИТЬ ПО
		//			 |	ДатаПоследнегоДокумента УБЫВ";
		//Запрос.УстановитьПараметр("КассаККМ",ТекКасса.КассаККМ);
		//Запрос.УстановитьПараметр("ДатаПоследнегоДокумента",Дата);
		//Выборка=Запрос.Выполнить().Выбрать();
		//Если Выборка.Следующий() Тогда
		//	ДатаНачало=Выборка.ДатаПоследнегоДокумента;
		//Иначе
		//	ДатаНачало=Неопределено;
		//КонецЕсли; 
		////Выборка чеков на оплату по кассе ККМ
		//Запрос=Новый Запрос;
		//Запрос=Новый Запрос;
		//Запрос.Текст="ВЫБРАТЬ
		//             |	ЧекОплаты.Ссылка.ФР КАК ФР,
		//             |	ЧекОплаты.Ссылка КАК Чек,
		//             |	ЧекОплаты.Ссылка.Проведен КАК Проведен,
		//             |	СУММА(ВЫБОР
		//             |			КОГДА ЧекОплаты.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.Чек)
		//             |				ТОГДА ЧекОплаты.Сумма
		//             |			ИНАЧЕ -ЧекОплаты.Сумма
		//             |		КОНЕЦ) КАК Сумма
		//             |ИЗ
		//             |	Документ.Чек.Оплаты КАК ЧекОплаты
		//             |ГДЕ
		//             |	(НЕ ЧекОплаты.Ссылка.ПометкаУдаления)
		//             |	И ЧекОплаты.Ссылка.НомерЧека > 0
		//             |	И ЧекОплаты.Ссылка.ДатаФР <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//             |	И ЧекОплаты.Ссылка.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекОтложенный)
		//             |	И ЧекОплаты.Ссылка.Дата <= &ДатаКонец
		//             |	И ЧекОплаты.Ссылка.КассаККМ = &КассаККМ
		//			 |	"+?(ДатаНачало=Неопределено,"","И ЧекОплаты.Ссылка.Дата > &ДатаНачало")+"
		//             |
		//             |СГРУППИРОВАТЬ ПО
		//             |	ЧекОплаты.Ссылка,
		//             |	ЧекОплаты.Ссылка.Проведен,
		//             |	ЧекОплаты.Ссылка.ФР
		//             |
		//             |ОБЪЕДИНИТЬ ВСЕ
		//             |
		//             |ВЫБРАТЬ
		//             |	ЧекНаОплату.Ссылка.ФР,
		//             |	ЧекНаОплату.Ссылка,
		//             |	ЧекНаОплату.Ссылка.Проведен,
		//             |	СУММА(ВЫБОР
		//             |			КОГДА ЧекНаОплату.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаОплату)
		//             |				ТОГДА ЧекНаОплату.Сумма
		//             |			ИНАЧЕ -ЧекНаОплату.Сумма
		//             |		КОНЕЦ)
		//             |ИЗ
		//             |	Документ.ЧекНаОплату.Оплаты КАК ЧекНаОплату
		//             |ГДЕ
		//             |	(НЕ ЧекНаОплату.Ссылка.ПометкаУдаления)
		//             |	И ЧекНаОплату.Ссылка.НомерЧека > 0
		//             |	И ЧекНаОплату.Ссылка.ДатаФР <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//             |	И ЧекНаОплату.Ссылка.Дата <= &ДатаКонец
		//             |	И ЧекНаОплату.Ссылка.КассаККМ = &КассаККМ
		//			 |	"+?(ДатаНачало=Неопределено,"","И ЧекНаОплату.Ссылка.Дата > &ДатаНачало")+"
		//             |
		//             |СГРУППИРОВАТЬ ПО
		//             |	ЧекНаОплату.Ссылка,
		//             |	ЧекНаОплату.Ссылка.Проведен,
		//             |	ЧекНаОплату.Ссылка.ФР
		//             |
		//             |ОБЪЕДИНИТЬ ВСЕ
		//             |
		//             |ВЫБРАТЬ
		//             |	ПКО.ФР,
		//             |	ПКО.Ссылка,
		//             |	ПКО.Проведен,
		//             |	ПКО.СуммаДокумента КАК Сумма
		//             |ИЗ
		//             |	Документ.ПриходныйКассовыйОрдер КАК ПКО
		//             |ГДЕ
		//             |	(НЕ ПКО.ПометкаУдаления)
		//             |	И ПКО.НомерЧека > 0
		//             |	И ПКО.ДатаФР <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		//             |	И ПКО.Дата <= &ДатаКонец
		//			 |	"+?(ДатаНачало=Неопределено,"","И ПКО.Дата > &ДатаНачало")+"
		//             |
		//             |СГРУППИРОВАТЬ ПО
		//             |	ПКО.Ссылка,
		//             |	ПКО.Ссылка.Проведен,
		//             |	ПКО.Ссылка.ФР
		//			 |
		//			 |
		//             |ИТОГИ
		//             |	СУММА(Сумма)
		//             |ПО
		//             |	ФР,
		//             |	Проведен";
		//			 
		//Запрос.УстановитьПараметр("ДатаКонец", Дата);
		//Запрос.УстановитьПараметр("ДатаНачало", ДатаНачало);
		//Запрос.УстановитьПараметр("КассаККМ", ТекКасса.КассаККМ);

		//ВыборкаПоФР = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		//Пока ВыборкаПоФР.Следующий() Цикл
		//	ТекФР = ВыборкаПоФР.ФР;
		//	
		//	СтрокаОборудования = Оборудование.Найти(ТекФР,"Оборудование");
		//	Если СтрокаОборудования = Неопределено ИЛИ НЕ СтрокаОборудования.Использовать Тогда
		//		Продолжить;
		//	КонецЕсли;	
		//	
		//	//Получаем сумму, если конечно до этого ее уже не получили
		//	СуммаОборотаПоФР = СуммыВФР.Получить(ТекФР);
		//	Если СуммаОборотаПоФР = Неопределено Тогда 
		//		//Получаем данные о продажах и возвратах из ФР
		//		Если СтатусыОборудования[ТекФР]<>Перечисления.СтатусыОборудования.Включено Тогда Продолжить; КонецЕсли;
		//        GUID_ФР = ТекФР.ИдентификаторОборудования;
		//		SafeArrayСтатусыФР=Рарус_Компонента.СоздатьПараметры(,);
		//		КодОшибки=Рарус_Компонента.ЗаказатьВыполнениеДействияСинхронно(GUID_ФР,"ПолучитьСтатус",SafeArrayСтатусыФР,ТаймаутФР);
		//		Если НЕ КодОшибки = 0 Тогда
		//			Если НЕ РазрешитьЗакрытиеСменыПриРасхождениях Тогда
		//				СообщитьПользователю("Ошибка при получении статуса оборудования "+ТекФР+"
		//					|Проверка расхождения сумм не может быть выполнена.
		//					|Закрытие кассовой смены ПРЕРВАНО");
		//				Возврат Ложь;
		//			КонецЕсли;
		//			
		//			Если Вопрос("Ошибка при получении статуса оборудования "+ТекФР+"
		//					|Проверка расхождения сумм на этом ФР не может быть выполнена.
		//					|Продолжить закрытие кассовой смены?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		//				Возврат Ложь;
		//			Иначе
		//				Продолжить;
		//			КонецЕсли;
		//		КонецЕсли;

		//		Попытка	
		//			SafeArrayСчетчикиФР=SafeArrayСтатусыФР.GetValue(0, 0);
		//			СуммаПродаж=Окр(Число(SafeArrayСчетчикиФР.GetValue(5, 0)),2);
		//			Если СуммаПродаж<0 Тогда
		//				СуммаПродаж=0;
		//			КонецЕсли; 
		//			СуммаВозвратов=Окр(Число(SafeArrayСчетчикиФР.GetValue(6, 0)),2);
		//			Если СуммаВозвратов<0 Тогда
		//				СуммаВозвратов=0;
		//			КонецЕсли; 
		//		Исключение
		//			Если НЕ РазрешитьЗакрытиеСменыПриРасхождениях Тогда
		//				СообщитьПользователю("Ошибка при получении итогов смены из оборудования "+ТекФР+ТекФР+"
		//					|"+ОписаниеОшибки()+"
		//					|Проверка расхождения сумм не может быть выполнена.
		//					|Закрытие кассовой смены ПРЕРВАНО");
		//				Возврат Ложь;
		//			КонецЕсли;
		//			
		//			Если Вопрос("Ошибка при получении итогов смены из оборудования "+ТекФР+"
		//					|"+ОписаниеОшибки()+"
		//					|Проверка расхождения сумм на этом ФР не может быть выполнена.
		//					|Продолжить закрытие кассовой смены?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		//				Возврат Ложь;
		//			Иначе
		//				Продолжить;	
		//			КонецЕсли;
		//		КонецПопытки;	
		//		
		//		СуммаОборотаПоФР = СуммаПродаж - СуммаВозвратов;
		//		СуммыВФР.Вставить(ТекФР,СуммаОборотаПоФР);
		//	КонецЕсли;
		//	
		//	ВыборкаСумм = ВыборкаПоФР.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//	СуммаПроведенных = 0;
		//	СуммаНепроведенных = 0;
		//	Пока ВыборкаСумм.Следующий() Цикл
		//		Если ВыборкаСумм.Проведен Тогда
		//			СуммаПроведенных = ВыборкаСумм.Сумма;
		//		Иначе
		//			СуммаНепроведенных = ВыборкаСумм.Сумма;
		//			ВыборкаНепроведенных = ВыборкаСумм.Выбрать();
		//		КонецЕсли;
		//	КонецЦикла;
		//	
		//	Если СуммаОборотаПоФР = СуммаПроведенных Тогда
		//		//Все ОК
		//		Продолжить;
		//	КонецЕсли;
		//	
		//	ФормаНепроведенныхДокументов = ПолучитьФорму("ФормаНепроведенныхДокументов");
		//	НепроведенныеДокументы = ФормаНепроведенныхДокументов.НепроведенныеДокументы;
		//	НепроведенныеДокументы.Очистить();
		//	
		//	Если НЕ ВыборкаНепроведенных = Неопределено Тогда
		//		Пока ВыборкаНепроведенных.Следующий() Цикл
		//			НоваяСтрока = НепроведенныеДокументы.Добавить();
		//			НоваяСтрока.Флаг = Истина;
		//			НоваяСтрока.Документ = ВыборкаНепроведенных.Чек;
		//			НоваяСтрока.Сумма = ВыборкаНепроведенных.Сумма;
		//		КонецЦикла;	
		//	КонецЕсли;
		//	
		//	ФормаНепроведенныхДокументов.ТекстККМ = "ККМ: " + ТекКасса.КассаККМ;
		//	ФормаНепроведенныхДокументов.ТекстККМОборот = "Оборот по ККМ: " + Формат(СуммаПроведенных,"ЧДЦ=2");
		//	ФормаНепроведенныхДокументов.ТекстФР = "ФР: " + ТекФР;
		//	ФормаНепроведенныхДокументов.ТекстФРОборот = "Оборот по ФР: " + Формат(СуммаОборотаПоФР,"ЧДЦ=2");
		//	
		//	Результат = Результат И ФормаНепроведенныхДокументов.ОткрытьМодально();
		//		
		//КонецЦикла;
		
		//Определим последний документ инкассации смены по данной кассе
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		             |	КассыККМ.Регистратор.Дата КАК РегистраторДата
		             |ИЗ
		             |	РегистрНакопления.КассыККМ КАК КассыККМ
		             |ГДЕ
		             |	КассыККМ.Регистратор ССЫЛКА Документ.Инкассация
		             |	И КассыККМ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		             |	И КассыККМ.Регистратор.КассаККМ = &КассаККМ
		             |	И КассыККМ.Регистратор.Проведен = ИСТИНА
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	РегистраторДата УБЫВ";
		Запрос.УстановитьПараметр("КассаККМ",ТекКасса.КассаККМ);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаНачала=Выборка.РегистраторДата;
		Иначе
			ДатаНачала=Неопределено;
		КонецЕсли; 
					 
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	КассыККМ.Регистратор.ФР КАК ФР,
		             |	СУММА(КассыККМ.Сумма) КАК Сумма
		             |ИЗ
		             |	РегистрНакопления.КассыККМ КАК КассыККМ
		             |ГДЕ
		             |	КассыККМ.Период МЕЖДУ &ДатаНачала И &ДатаКонца
		             |	И (КассыККМ.Регистратор ССЫЛКА Документ.Чек
		             |			ИЛИ КассыККМ.Регистратор ССЫЛКА Документ.ЧекНаОплату
		             |			ИЛИ КассыККМ.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		             |			ИЛИ КассыККМ.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
		             |			ИЛИ КассыККМ.Регистратор ССЫЛКА Документ.Инкассация)
		             |	И КассыККМ.СпособОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные)
		             |	И КассыККМ.КассаККМ = &КассаККМ
		             |	И КассыККМ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	КассыККМ.ВидДвижения,
		             |	КассыККМ.Регистратор.ФР
		             |
		             |ОБЪЕДИНИТЬ ВСЕ
		             |
		             |ВЫБРАТЬ
		             |	КассыККМ.Регистратор.ФР,
		             |	-СУММА(КассыККМ.Сумма)
		             |ИЗ
		             |	РегистрНакопления.КассыККМ КАК КассыККМ
		             |ГДЕ
		             |	КассыККМ.Период МЕЖДУ &ДатаНачала И &ДатаКонца
		             |	И (КассыККМ.Регистратор ССЫЛКА Документ.Чек
		             |			ИЛИ КассыККМ.Регистратор ССЫЛКА Документ.ЧекНаОплату
		             |			ИЛИ КассыККМ.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
		             |			ИЛИ КассыККМ.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер)
		             |	И КассыККМ.СпособОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные)
		             |	И КассыККМ.КассаККМ = &КассаККМ
		             |	И КассыККМ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	КассыККМ.Регистратор.ФР";
		Запрос.УстановитьПараметр("КассаККМ",ТекКасса.КассаККМ);
		Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКонца",Дата);
		ДвиженияПоКассеККМ=Запрос.Выполнить().Выгрузить();
		ДвиженияПоКассеККМ.Свернуть("ФР","Сумма");
		
		Для каждого ДвижениеПоКассеККМ Из ДвиженияПоКассеККМ Цикл
			ТекФР = ДвижениеПоКассеККМ.ФР;
			
			СтрокаОборудования = Оборудование.Найти(ТекФР,"Оборудование");
			Если СтрокаОборудования = Неопределено ИЛИ НЕ СтрокаОборудования.Использовать Тогда
				Продолжить;
			КонецЕсли;	
			
			//Получаем сумму, если конечно до этого ее уже не получили
			СуммаОборотаПоФР = СуммыВФР.Получить(ТекФР);
			Если СуммаОборотаПоФР = Неопределено Тогда 
				//Получаем данные о продажах и возвратах из ФР
				Если СтатусыОборудования[ТекФР]<>Перечисления.СтатусыОборудования.Включено Тогда Продолжить; КонецЕсли;
				GUID_ФР = ТекФР.ИдентификаторОборудования;
				SafeArrayСтатусыФР=Рарус_Компонента.СоздатьПараметры(,);
				КодОшибки=Рарус_Компонента.ЗаказатьВыполнениеДействияСинхронно(GUID_ФР,"ПолучитьСтатус",SafeArrayСтатусыФР,ТаймаутФР);
				Если НЕ КодОшибки = 0 Тогда
					Если НЕ РазрешитьЗакрытиеСменыПриРасхождениях Тогда
						СообщитьПользователю("Ошибка при получении статуса оборудования "+ТекФР+"
							|Проверка расхождения сумм не может быть выполнена.
							|Закрытие кассовой смены ПРЕРВАНО");
						Возврат Ложь;
					КонецЕсли;
					
					Если Вопрос("Ошибка при получении статуса оборудования "+ТекФР+"
							|Проверка расхождения сумм на этом ФР не может быть выполнена.
							|Продолжить закрытие кассовой смены?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
						Возврат Ложь;
					Иначе
						Продолжить;
					КонецЕсли;
				КонецЕсли;

				Попытка	
					//SafeArrayСчетчикиФР=SafeArrayСтатусыФР.GetValue(0, 0);
					//СуммаПродаж=Окр(Число(SafeArrayСчетчикиФР.GetValue(5, 0)),2);
					//Если СуммаПродаж<0 Тогда
					//	СуммаПродаж=0;
					//КонецЕсли; 
					//СуммаВозвратов=Окр(Число(SafeArrayСчетчикиФР.GetValue(6, 0)),2);
					//Если СуммаВозвратов<0 Тогда
					//	СуммаВозвратов=0;
					//КонецЕсли; 
					SafeArrayТаблицаОстатковВКассе=SafeArrayСтатусыФР.GetValue(1,0);
					СуммаОборотаПоФР=SafeArrayТаблицаОстатковВКассе.GetValue(0,2);
				Исключение
					Если НЕ РазрешитьЗакрытиеСменыПриРасхождениях Тогда
						СообщитьПользователю("Ошибка при получении итогов смены из оборудования "+ТекФР+ТекФР+"
							|"+ОписаниеОшибки()+"
							|Проверка расхождения сумм не может быть выполнена.
							|Закрытие кассовой смены ПРЕРВАНО");
						Возврат Ложь;
					КонецЕсли;
					
					Если Вопрос("Ошибка при получении итогов смены из оборудования "+ТекФР+"
							|"+ОписаниеОшибки()+"
							|Проверка расхождения сумм на этом ФР не может быть выполнена.
							|Продолжить закрытие кассовой смены?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
						Возврат Ложь;
					Иначе
						Продолжить;	
					КонецЕсли;
				КонецПопытки;	
				
				//СуммаОборотаПоФР = СуммаПродаж - СуммаВозвратов;
				СуммыВФР.Вставить(ТекФР,СуммаОборотаПоФР);
			КонецЕсли;
			
			СуммаПоКассеККМ = ДвижениеПоКассеККМ.Сумма;
			
			Если СуммаОборотаПоФР = СуммаПоКассеККМ Тогда
				//Все ОК
				Продолжить;
			КонецЕсли;
			
			ФормаНепроведенныхДокументов = ПолучитьФорму("ФормаНепроведенныхДокументов");
			НепроведенныеДокументы = ФормаНепроведенныхДокументов.НепроведенныеДокументы;
			НепроведенныеДокументы.Очистить();
			
			//Если НЕ ВыборкаНепроведенных = Неопределено Тогда
			//	Пока ВыборкаНепроведенных.Следующий() Цикл
			//		НоваяСтрока = НепроведенныеДокументы.Добавить();
			//		НоваяСтрока.Флаг = Истина;
			//		НоваяСтрока.Документ = ВыборкаНепроведенных.Чек;
			//		НоваяСтрока.Сумма = ВыборкаНепроведенных.Сумма;
			//	КонецЦикла;	
			//КонецЕсли;
			
			ФормаНепроведенныхДокументов.ТекстККМ = "ККМ: " + ТекКасса.КассаККМ;
			ФормаНепроведенныхДокументов.ТекстККМОборот = "Оборот по ККМ: " + Формат(СуммаПоКассеККМ,"ЧДЦ=2");
			ФормаНепроведенныхДокументов.ТекстФР = "ФР: " + ТекФР;
			ФормаНепроведенныхДокументов.ТекстФРОборот = "Оборот по ФР: " + Формат(СуммаОборотаПоФР,"ЧДЦ=2");
			
			Результат = Результат И ФормаНепроведенныхДокументов.ОткрытьМодально();
				
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции	

Функция ВыполнитьПечатьОтчетов()
	Возврат Истина;
КонецФункции // ВыполнитьПечатьОтчетов()

Функция ВыполнитьОбменДанными()
	Возврат Истина;
КонецФункции // ВыполнитьОбменДанными()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

Рарус_Компонента = глРарус_Компонента;

#КонецЕсли

Оборудование.Сортировать("Приоритет Возр, Компьютер Возр, Оборудование Возр");
СтатусыОборудования=Новый Соответствие();
